ReactDOM.render(<h1>Ласкаво просимо в наш інтернет магазин ІнтернетМагія</h1>, document.getElementById("header"))

ReactDOM.render(<div>
    <p>&copy; 2023 Інтернет магазин ІнтернетМагія. Всі права захищені.</p>
    <p>E-mail: Internetmagic@gmail.com</p>
    <p>Номер телефона: 099 386 45 25</p>
    <h4>Щоб оформити замолення пишіть в наші соціальні мережі:</h4>
    <a class="social-link" href="#" target="_blank">Facebook</a>
    <a class="social-link" href="#" target="_blank">Instagram</a>
    <a class="social-link" href="#" target="_blank">Telegram</a>
</div>, document.getElementById("footer"))

ReactDOM.render(<div>
    <a href="#header">Головна сторінка</a>
    <a href="#line">Ассортимент</a>
    <a href="#footer">Контакты</a>
</div>, document.getElementById("nav"))

ReactDOM.render(<div>
    <h2>Відкрийте Двері до Магічного Світу</h2>
    <p>Запрошуємо вас на унікальний світ магії та чарівництва. Дивіться, як звичайні предмети набувають неймовірних властивостей.</p>
</div>,document.getElementById("content"))

ReactDOM.render(<div>
    <img src="/image/2.jpg" alt="Вітальний хол нашого магазину"></img>
</div>, document.getElementById("img"))

ReactDOM.render(<h2>Ассортимент продукції</h2>, document.getElementById("line"))

ReactDOM.render(<div>
    <tr>
        <th>Талісмани</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Талісман "Драконів Вогонь"</td>
        <td>Цей талісман виготовлений з високоякісного кришталю та орнаментований золотом у формі дракона, який обгортає вогнями. Дракон вважається символом сили, захисту та владарюючої енергії. Вогонь, що оточує дракона, відображає силу внутрішнього вогню та ентузіазму.</td>
        <td>350 гривень</td>
    </tr>
    <tr>
        <td>Талісман "Ластівчине щастя"</td>
        <td>Елегантний талісман, виготовлений зі срібла та викритий емаллю зі зображенням ластівки. Ластівка - символ радості, щастя та плавного переходу. Цей талісман призначений для тих, хто шукає щастя та позитивні зміни у своєму житті.</td>
        <td>250 гривень</td>
    </tr>
    <tr>
        <th>Амулети</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Амулет "Місячне Сяйво"</td>
        <td>Амулет у вигляді півмісяця, виготовлений зі срібла та вставками місячного каменю. Цей амулет взаємодіє з енергією місяця та відображає його таємничість. Він відомий своєю здатністю зміцнювати інтуїцію та привертати позитивну енергію.</td>
        <td>250 гривень</td>
    </tr>
    <tr>
        <td>Амулет "Кришталева Рівновага"</td>
        <td>Амулет, виготовлений з прозорого кришталю у формі мандали. Кришталь відомий своєю здатністю вирівнювати та збалансовувати енергію. Цей амулет сприяє гармонії, внутрішньому спокою та збалансованому розвитку.</td>
        <td>320 гривень</td>
    </tr>
    <tr>
        <th>Свічки</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Свічка "Ліхтар Свічення"</td>
        <td>Ця свічка виглядає як старовинний ліхтар, що створює тепле та затишне світло. Вона виготовлена зі сплаву металів та скла, а її дизайн інспірований стародавніми магічними символами. Коли свічка горить, вона створює тіні, які розташовані так, ніби ліхтар веде вас до магічного світу.</td>
        <td>95 гривень</td>
    </tr>
    <tr>
        <td>Свічка "Аурора Небесна"</td>
        <td>Ця свічка створює вражаючий ефект аурори на небі. Виготовлена з прозорого парафіну та вкрапленою у неї фарбою, що переливається, вона має спеціальні світлодіоди, що створюють м'яке та мінливе світло. Ця свічка дарує вам відчуття дивовижного небесного світла прямо в вашому просторі.</td>
        <td>80 гривень</td>
    </tr>
    <tr>
        <th>Світляники</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Світляник "Магічний Ліс"</td>
        <td>Цей світляник створює чарівний ефект, нагадуючи лісову ауру. Виготовлений з екологічно чистого дерева та скла, він має встроєні світлодіоди, які створюють м'яке світло. Дизайн у формі гілок, листя та кришталевих вставок, що переливаються, робить його чудовим елементом для створення атмосфери магії у вашому просторі.</td>
        <td>220 гривень</td>
    </tr>
    <tr>
        <td>Світляник "Магічний Кришталевий Сад"</td>
        <td>ЦЦей світляник представляє собою кришталевий сад, наповнений магічними квітами та феєричними метеликами. Виготовлений з кришталю та металу, він освітлюється LED-лампочками, які створюють казковий вигляд. Цей світляник чудово підійде для створення атмосфери магії та краси в вашому просторі.</td>
        <td>250 гривень</td>
    </tr>
</div>, document.getElementById("table1"))

ReactDOM.render(<h3>Магічні Артефакти</h3>, document.getElementById("type1"))

ReactDOM.render(<h3>Магічні Артефакти</h3>, document.getElementById("type2"))

ReactDOM.render(<div>
    <tr>
        <th>Книги з рецептами</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Книга "Аркана Смаку: Магія Кулінарії"</td>
        <td>Ця чарівна кулінарна книга призначена для тих, хто бажає додати магії до свого кулінарного мистецтва. Вона містить рецепти з ароматерапією, закляття на збільшення смаку та дієвість їжі. Завдяки цій книзі ви зможете створити страви, що не тільки задовольнять ваші смакові рецептори, але й принесуть радість та енергію.</td>
        <td>150 гривень</td>
    </tr>
    <tr>
        <td>Книга "Магічна Солодка Кухня: Рецепти Солодощів та Заклять для Солодких Моментів"</td>
        <td>У цій чарівній книзі вас чекають найсолодші та наймагічніші рецепти для приготування унікальних солодощів. Від чарівницьких печива до магічних тортів – кожен рецепт супроводжується закляттям або обрядом, які надають вашим десертам особливий смак та енергетику. Завдяки цій книзі ви зможете створювати не лише смачні, але й магічні ласощі для ваших солодких моментів.</td>
        <td>155 гривень</td>
    </tr>
    <tr>
        <th>Книги заклять</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Книга "Таємниці Стереження Енергій: Закляття та Обряди"</td>
        <td>Ця книга розкриває таємниці збереження та використання енергії навколо вас. Вона містить докладні описи заклять і ритуалів для захисту від негативної енергії, а також техніки для збільшення енергетичного потенціалу. Книга стане вам незамінним джерелом знань для того, щоб створити енергетичний щит для гармонії та благополуччя.</td>
        <td>135 гривень</td>
    </tr>
    <tr>
        <td>Книга "Слова Власної Сили: Закляття для Укріплення Своєї Долі"</td>
        <td>У цій книзі ви знайдете закляття та афірмації, які допоможуть вам впливати на свою долю та власний життєвий шлях. Кожна сторінка наповнена словами, що збуджують позитивні енергії та допомагають привертати до вас бажані зміни. Книга створена для тих, хто шукає власну силу та вплив на власну долю.</td>
        <td>120 гривень</td>
    </tr>
</div>, document.getElementById("table2"))

ReactDOM.render(<h3>Колекціонерські предмети</h3>, document.getElementById("type3"))

ReactDOM.render(<div>
    <tr>
        <th>Годиники</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Ексклюзивний Магічний Годинник "Час Відкриття Воріт"</td>
        <td>Цей годинник представляє собою чарівний артефакт, на циферблаті якого зображені містичні символи. Коли стрілки доходять до певного моменту, ворота на годиннику відкриваються, виносячи на вид колекційний предмет - маленький артефакт, що володіє особливими властивостями.</td>
        <td>350 гривень</td>
    </tr>
    <tr>
        <td>Колекційний Магічний Годинник "Зоряний Танець"</td>
        <td>Цей елегантний годинник представляє собою танець зірок на темному небі. Його циферблат виготовлений з прозорого матеріалу, який світиться вночі, створюючи ефект зіркового неба. Годинник має вбудовані фази місяця та символіку зодіаку, додаючи до нього магічний шарм.</td>
        <td>455 гривень</td>
    </tr>
    <tr>
        <th>Картини</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Магічна Картина "Літаючі Феї на Сході Сонця"</td>
        <td>Ця картина відображає мальовничий пейзаж, де літаючі феї оживають на фоні розсвіченого сходу сонця. Вона створена в техніці акрилового живопису, що дозволяє кожній деталі виразно виблискувати. Енергія та магія цієї картини роблять її чудовим прикрасою для будь-якого магічного простору.</td>
        <td>235 гривень</td>
    </tr>
    <tr>
        <td>Магічна Картина "Вогненне Зійдання Магії"</td>
        <td>Ця картинка створена в техніці світлодіодного живопису, де кожен елемент малюнка освітлюється за допомогою вбудованих LED-лампочок. Зображено магічне зійдання, яке перетворюється в калейдоскоп вогнів і тіней при освітленні. Це унікальне та ефектне мистецтво для будь-якого колекціонера.</td>
        <td>320 гривень</td>
    </tr>
    <tr>
        <th>Статуетки</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Колекціонерська Статуетка "Древній Вартовий Страж"</td>
        <td> Ця статуетка виготовлена з високоякісного каменю та зображує стародавнього вартового стража. Вважається, що вона притягує захист та мудрість. Кожна статуетка унікальна, оскільки виготовлена вручну з врахуванням деталей, що робить її особливою для колекціонерів.</td>
        <td>520 гривень</td>
    </tr>
    <tr>
        <td>Колекціонерська Статуетка "Лісовий Дух Зеленого Місяця"</td>
        <td>Ця статуетка вирізняється своєю неповторною формою та виготовлена з екологічно чистих матеріалів. Зображено лісового духа, який втілює енергію зеленого місяця. Кожна статуетка ручно виготовлена та має свою унікальну текстуру, що робить її цінним елементом колекції.</td>
        <td>420 гривень</td>
    </tr>
</div>, document.getElementById("table3"))

ReactDOM.render(<h3>Одяг та аксесуари</h3>, document.getElementById("type4"))

ReactDOM.render(<div>
    <tr>
        <th>Одяг</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Костюм "Магічна Покоївка"</td>
        <td>Зануртеся в світ чарівної служниці з цим чудовим костюмом "Магічна Покоївка". Він складається з ефектного фартуха з аплікацією чарівних рун, надаючи йому загадковий вид. Комбінована з вишуканим платтям та чепчиком із вушками, ця обновка додасть вашому образу атмосферу магії та завороження.</td>
        <td>650 гривень</td>
    </tr>
    <tr>
        <td>Костюм "Легендарна Відьма"</td>
        <td>Витягніть своє відьмине коло та вдягніться в костюм "Легендарна Відьма". Цей костюм включає в себе розшиту рясу з написами заклять та містичний пелюшок для голови. Завдяки деталям, що світяться у темряві, ви будете виглядати як справжня магія, готова завести свої відьмині таємниці.</td>
        <td>550 гривень</td>
    </tr>
    <tr>
        <th>Аксесуари</th>
        <th>Опис</th>
        <th>Ціна</th>
    </tr>
    <tr>
        <td>Аксесуар "Кришталевий Ключ до Загадкових Дверей"</td>
        <td>Цей кришталевий ключ - витончений аксесуар, який притягає увагу своєю загадковістю. Виготовлений з яскравого кришталю у вигляді ключа, він має дрібні елементи, які імітують обертаючийся механізм. Цей аксесуар стане чудовим доповненням до вашого образу магічного володаря або володарки.</td>
        <td>355 гривень</td>
    </tr>
    <tr>
        <td>Аксесуар "Ліхтарик Магічного Вогню"</td>
        <td>Цей амулет-ліхтарик подарує вашому образу та простору магічний вогняний вигляд. Виготовлений зі спеціального матеріалу, що імітує плам'я, він прикріплюється до одягу чи сумки. Ліхтарик має три режими свічення та може бути використаний як стильний аксесуар або як елемент магічного ритуалу.</td>
        <td>320 гривень</td>
    </tr>
</div>, document.getElementById("table4"))

